ebowwa/MentraOS/mcu_client/nrf5340_ble_simulator/src/main.c
/*
 * Copyright (c) 2018 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

/** @file
 *  @brief Nordic UART Bridge Service (NUS) sample
 */
#include <uart_async_adapter.h>

#include <zephyr/types.h>
#include <zephyr/kernel.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/usb/usb_device.h>

#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/display.h>
#include <soc.h>

#include <zephyr/bluetooth/bluetooth.h>
#include <zephyr/bluetooth/uuid.h>
#include <zephyr/bluetooth/gatt.h>
#include <zephyr/bluetooth/hci.h>

#include "mentra_ble_service.h"
#include "protobuf_handler.h"
#include "bsp_log.h"
#include "mos_lvgl_display.h"  // Working LVGL display integration
#include "display/lcd/hls12vga.h"  // Working HLS12VGA driver

#include <dk_buttons_and_leds.h>

#include <zephyr/settings/settings.h>

#include <stdio.h>
#include <string.h>

#include <zephyr/logging/log.h>
#include <nrfx_clock.h>

#define LOG_MODULE_NAME peripheral_uart
LOG_MODULE_REGISTER(LOG_MODULE_NAME);

static int hfclock_config_and_start(void)
{
	int ret;
	/* Use this to turn on 128 MHz clock for cpu_app */
	ret = nrfx_clock_divider_set(NRF_CLOCK_DOMAIN_HFCLK, NRF_CLOCK_HFCLK_DIV_1);
	ret -= NRFX_ERROR_BASE_NUM;
	if (ret)
	{
		return ret;
	}
	nrfx_clock_hfclk_start();
	while (!nrfx_clock_hfclk_is_running())
	{
	}
	return 0;
}
// 初始化高频时钟128Mhz运行模式
SYS_INIT(hfclock_config_and_start, POST_KERNEL, 0);

#define STACKSIZE 2048
#define PRIORITY 7

#define DEVICE_NAME CONFIG_BT_DEVICE_NAME
#define DEVICE_NAME_LEN	(sizeof(DEVICE_NAME) - 1)

#define RUN_STATUS_LED DK_LED1
#define RUN_LED_BLINK_INTERVAL 1000

#define CON_STATUS_LED DK_LED2

#define KEY_PASSKEY_ACCEPT DK_BTN1_MSK
#define KEY_PASSKEY_REJECT DK_BTN2_MSK

// Battery level control buttons
#define KEY_BATTERY_INCREASE DK_BTN1_MSK  // Button 1: Increase battery
#define KEY_BATTERY_DECREASE DK_BTN2_MSK  // Button 2: Decrease battery
#define KEY_BATTERY_CHARGING_TOGGLE DK_BTN3_MSK  // Button 3: Toggle charging status

// LVGL pattern cycling button
#define KEY_LVGL_PATTERN_CYCLE DK_BTN4_MSK  // Button 4: Cycle LVGL test patterns

// **NEW: Direct HLS12VGA grayscale pattern shortcuts (using combinations)**
// Hold Button 3 + Button 1: Horizontal grayscale
// Hold Button 3 + Button 2: Vertical grayscale
// Hold Button 3 + Button 4: Chess pattern
#define KEY_GRAYSCALE_MODIFIER DK_BTN3_MSK
#define KEY_HORIZONTAL_GRAYSCALE (DK_BTN3_MSK | DK_BTN1_MSK)
#define KEY_VERTICAL_GRAYSCALE (DK_BTN3_MSK | DK_BTN2_MSK)
#define KEY_CHESS_PATTERN (DK_BTN3_MSK | DK_BTN4_MSK)

#define UART_BUF_SIZE 240
#define UART_WAIT_FOR_BUF_DELAY K_MSEC(50)
#define UART_WAIT_FOR_RX 50

static K_SEM_DEFINE(ble_init_ok, 0, 1);

static struct bt_conn *current_conn;
static struct bt_conn *auth_conn;
static struct k_work adv_work;

static const struct device *uart = DEVICE_DT_GET(DT_CHOSEN(nordic_nus_uart));
static struct k_work_delayable uart_work;

struct uart_data_t {
	void *fifo_reserved;
	uint8_t data[UART_BUF_SIZE];
	uint16_t len;
};

static K_FIFO_DEFINE(fifo_uart_tx_data);
static K_FIFO_DEFINE(fifo_uart_rx_data);

static char dynamic_device_name[32] = "NexSim";
static struct bt_data ad[] = {
	BT_DATA_BYTES(BT_DATA_FLAGS, (BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR)),
	BT_DATA(BT_DATA_NAME_COMPLETE, "NexSim", 6),
};
static struct bt_data sd[] = {
	BT_DATA_BYTES(BT_DATA_UUID128_ALL, BT_UUID_MENTRA_VAL),
};

static void setup_dynamic_advertising(void)
{
	bt_addr_le_t addr;
	size_t count = 1;
	
	// Get the device address
	bt_id_get(&addr, &count);
	
	// Create device name with MAC suffix (last 6 hex digits)
	snprintf(dynamic_device_name, sizeof(dynamic_device_name), 
		 "NexSim %02X%02X%02X", 
		 addr.a.val[2], addr.a.val[1], addr.a.val[0]);
	
	LOG_INF("Device name: %s", dynamic_device_name);
	
	// Set the Bluetooth device name
	int err = bt_set_name(dynamic_device_name);
	if (err) {
		LOG_ERR("Failed to set device name (err %d)", err);
	}
	
	// Update the advertising data with the new name
	ad[1].data = (const uint8_t *)dynamic_device_name;
	ad[1].data_len = strlen(dynamic_device_name);
}

#ifdef CONFIG_UART_ASYNC_ADAPTER
UART_ASYNC_ADAPTER_INST_DEFINE(async_adapter);
#else
#define async_adapter NULL
#endif

static void uart_cb(const struct device *dev, struct uart_event *evt, void *user_data)
{
	ARG_UNUSED(dev);

	static size_t aborted_len;
	struct uart_data_t *buf;
	static uint8_t *aborted_buf;
	static bool disable_req;

	switch (evt->type) {
	case UART_TX_DONE:
		LOG_DBG("UART_TX_DONE");
		if ((evt->data.tx.len == 0) ||
		    (!evt->data.tx.buf)) {
			return;
		}

		if (aborted_buf) {
			buf = CONTAINER_OF(aborted_buf, struct uart_data_t,
					   data[0]);
			aborted_buf = NULL;
			aborted_len = 0;
		} else {
			buf = CONTAINER_OF(evt->data.tx.buf, struct uart_data_t,
					   data[0]);
		}

		k_free(buf);

		buf = k_fifo_get(&fifo_uart_tx_data, K_NO_WAIT);
		if (!buf) {
			return;
		}

		if (uart_tx(uart, buf->data, buf->len, SYS_FOREVER_MS)) {
			LOG_WRN("Failed to send data over UART");
		}

		break;

	case UART_RX_RDY:
		LOG_DBG("UART_RX_RDY");
		buf = CONTAINER_OF(evt->data.rx.buf, struct uart_data_t, data[0]);
		buf->len += evt->data.rx.len;

		if (disable_req) {
			return;
		}

		if ((evt->data.rx.buf[buf->len - 1] == '\n') ||
		    (evt->data.rx.buf[buf->len - 1] == '\r')) {
			disable_req = true;
			uart_rx_disable(uart);
		}

		break;

	case UART_RX_DISABLED:
		LOG_DBG("UART_RX_DISABLED");
		disable_req = false;

		buf = k_malloc(sizeof(*buf));
		if (buf) {
			buf->len = 0;
		} else {
			LOG_WRN("Not able to allocate UART receive buffer");
			k_work_reschedule(&uart_work, UART_WAIT_FOR_BUF_DELAY);
			return;
		}

		uart_rx_enable(uart, buf->data, sizeof(buf->data),
			       UART_WAIT_FOR_RX);

		break;

	case UART_RX_BUF_REQUEST:
		LOG_DBG("UART_RX_BUF_REQUEST");
		buf = k_malloc(sizeof(*buf));
		if (buf) {
			buf->len = 0;
			uart_rx_buf_rsp(uart, buf->data, sizeof(buf->data));
		} else {
			LOG_WRN("Not able to allocate UART receive buffer");
		}

		break;

	case UART_RX_BUF_RELEASED:
		LOG_DBG("UART_RX_BUF_RELEASED");
		buf = CONTAINER_OF(evt->data.rx_buf.buf, struct uart_data_t,
				   data[0]);

		if (buf->len > 0) {
			k_fifo_put(&fifo_uart_rx_data, buf);
		} else {
			k_free(buf);
		}

		break;

	case UART_TX_ABORTED:
		LOG_DBG("UART_TX_ABORTED");
		if (!aborted_buf) {
			aborted_buf = (uint8_t *)evt->data.tx.buf;
		}

		aborted_len += evt->data.tx.len;
		buf = CONTAINER_OF((void *)aborted_buf, struct uart_data_t,
				   data);

		uart_tx(uart, &buf->data[aborted_len],
			buf->len - aborted_len, SYS_FOREVER_MS);

		break;

	default:
		break;
	}
}

static void uart_work_handler(struct k_work *item)
{
	struct uart_data_t *buf;

	buf = k_malloc(sizeof(*buf));
	if (buf) {
		buf->len = 0;
	} else {
		LOG_WRN("Not able to allocate UART receive buffer");
		k_work_reschedule(&uart_work, UART_WAIT_FOR_BUF_DELAY);
		return;
	}

	uart_rx_enable(uart, buf->data, sizeof(buf->data), UART_WAIT_FOR_RX);
}

static bool uart_test_async_api(const struct device *dev)
{
	const struct uart_driver_api *api =
			(const struct uart_driver_api *)dev->api;

	return (api->callback_set != NULL);
}

static int uart_init(void)
{
	int err;
	int pos;
	struct uart_data_t *rx;
	struct uart_data_t *tx;

	if (!device_is_ready(uart)) {
		return -ENODEV;
	}

	if (IS_ENABLED(CONFIG_USB_DEVICE_STACK)) {
		err = usb_enable(NULL);
		if (err && (err != -EALREADY)) {
			LOG_ERR("Failed to enable USB");
			return err;
		}
	}

	rx = k_malloc(sizeof(*rx));
	if (rx) {
		rx->len = 0;
	} else {
		return -ENOMEM;
	}

	k_work_init_delayable(&uart_work, uart_work_handler);


	if (IS_ENABLED(CONFIG_UART_ASYNC_ADAPTER) && !uart_test_async_api(uart)) {
		/* Implement API adapter */
		uart_async_adapter_init(async_adapter, uart);
		uart = async_adapter;
	}

	err = uart_callback_set(uart, uart_cb, NULL);
	if (err) {
		k_free(rx);
		LOG_ERR("Cannot initialize UART callback");
		return err;
	}

	if (IS_ENABLED(CONFIG_UART_LINE_CTRL)) {
		LOG_INF("Wait for DTR");
		while (true) {
			uint32_t dtr = 0;

			uart_line_ctrl_get(uart, UART_LINE_CTRL_DTR, &dtr);
			if (dtr) {
				break;
			}
			/* Give CPU resources to low priority threads. */
			k_sleep(K_MSEC(100));
		}
		LOG_INF("DTR set");
		err = uart_line_ctrl_set(uart, UART_LINE_CTRL_DCD, 1);
		if (err) {
			LOG_WRN("Failed to set DCD, ret code %d", err);
		}
		err = uart_line_ctrl_set(uart, UART_LINE_CTRL_DSR, 1);
		if (err) {
			LOG_WRN("Failed to set DSR, ret code %d", err);
		}
	}

	tx = k_malloc(sizeof(*tx));

	if (tx) {
		pos = snprintf(tx->data, sizeof(tx->data),
			       "🚀 v2.2.0-DISPLAY_OPEN_FIX\r\n"
			       "📊 LVGL Test Pattern\r\n"
			       " display_open() added!\r\n"
			       "Ready!\r\n"
			       "====================\r\n");

		if ((pos < 0) || (pos >= sizeof(tx->data))) {
			k_free(rx);
			k_free(tx);
			LOG_ERR("snprintf returned %d", pos);
			return -ENOMEM;
		}

		tx->len = pos;
	} else {
		k_free(rx);
		return -ENOMEM;
	}

	err = uart_tx(uart, tx->data, tx->len, SYS_FOREVER_MS);
	if (err) {
		k_free(rx);
		k_free(tx);
		LOG_ERR("Cannot display welcome message (err: %d)", err);
		return err;
	}

	err = uart_rx_enable(uart, rx->data, sizeof(rx->data), UART_WAIT_FOR_RX);
	if (err) {
		LOG_ERR("Cannot enable uart reception (err: %d)", err);
		/* Free the rx buffer only because the tx buffer will be handled in the callback */
		k_free(rx);
	}

	return err;
}

static void adv_work_handler(struct k_work *work)
{
	// Setup dynamic advertising
	setup_dynamic_advertising();
	
	LOG_INF("Starting advertising with:");
	LOG_INF("  Device name: %s", dynamic_device_name);
	LOG_INF("  Service UUID: 00004860-0000-1000-8000-00805f9b34fb");
	LOG_INF("  Ad data entries: %d, Scan data entries: %d", ARRAY_SIZE(ad), ARRAY_SIZE(sd));
	
	int err = bt_le_adv_start(BT_LE_ADV_CONN_FAST_2, ad, 2, sd, 1);

	if (err) {
		LOG_ERR("Advertising failed to start (err %d)", err);
		return;
	}

	LOG_INF("Advertising successfully started with device name: %s", dynamic_device_name);
}

static void advertising_start(void)
{
	k_work_submit(&adv_work);
}

static void connected(struct bt_conn *conn, uint8_t err)
{
	char addr[BT_ADDR_LE_STR_LEN];

	if (err) {
		LOG_ERR("Connection failed, err 0x%02x %s", err, bt_hci_err_to_str(err));
		return;
	}

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));
	LOG_INF("Connected %s", addr);

	current_conn = bt_conn_ref(conn);

	dk_set_led_on(CON_STATUS_LED);
}

static void disconnected(struct bt_conn *conn, uint8_t reason)
{
	char addr[BT_ADDR_LE_STR_LEN];

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	LOG_INF("Disconnected: %s, reason 0x%02x %s", addr, reason, bt_hci_err_to_str(reason));

	if (auth_conn) {
		bt_conn_unref(auth_conn);
		auth_conn = NULL;
	}

	if (current_conn) {
		bt_conn_unref(current_conn);
		current_conn = NULL;
		dk_set_led_off(CON_STATUS_LED);
	}
}

static void recycled_cb(void)
{
	LOG_INF("Connection object available from previous conn. Disconnect is complete!");
	advertising_start();
}

#ifdef CONFIG_BT_NUS_SECURITY_ENABLED
static void security_changed(struct bt_conn *conn, bt_security_t level,
			     enum bt_security_err err)
{
	char addr[BT_ADDR_LE_STR_LEN];

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	if (!err) {
		LOG_INF("Security changed: %s level %u", addr, level);
	} else {
		LOG_WRN("Security failed: %s level %u err %d %s", addr, level, err,
			bt_security_err_to_str(err));
	}
}
#endif

BT_CONN_CB_DEFINE(conn_callbacks) = {
	.connected        = connected,
	.disconnected     = disconnected,
	.recycled         = recycled_cb,
#ifdef CONFIG_BT_NUS_SECURITY_ENABLED
	.security_changed = security_changed,
#endif
};

#if defined(CONFIG_BT_NUS_SECURITY_ENABLED)
static void auth_passkey_display(struct bt_conn *conn, unsigned int passkey)
{
	char addr[BT_ADDR_LE_STR_LEN];

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	LOG_INF("Passkey for %s: %06u", addr, passkey);
}

static void auth_passkey_confirm(struct bt_conn *conn, unsigned int passkey)
{
	char addr[BT_ADDR_LE_STR_LEN];

	auth_conn = bt_conn_ref(conn);

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	LOG_INF("Passkey for %s: %06u", addr, passkey);

	if (IS_ENABLED(CONFIG_SOC_SERIES_NRF54HX) || IS_ENABLED(CONFIG_SOC_SERIES_NRF54LX)) {
		LOG_INF("Press Button 0 to confirm, Button 1 to reject.");
	} else {
		LOG_INF("Press Button 1 to confirm, Button 2 to reject.");
	}
}


static void auth_cancel(struct bt_conn *conn)
{
	char addr[BT_ADDR_LE_STR_LEN];

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	LOG_INF("Pairing cancelled: %s", addr);
}


static void pairing_complete(struct bt_conn *conn, bool bonded)
{
	char addr[BT_ADDR_LE_STR_LEN];

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	LOG_INF("Pairing completed: %s, bonded: %d", addr, bonded);
}


static void pairing_failed(struct bt_conn *conn, enum bt_security_err reason)
{
	char addr[BT_ADDR_LE_STR_LEN];

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, sizeof(addr));

	LOG_INF("Pairing failed conn: %s, reason %d %s", addr, reason,
		bt_security_err_to_str(reason));
}

static struct bt_conn_auth_cb conn_auth_callbacks = {
	.passkey_display = auth_passkey_display,
	.passkey_confirm = auth_passkey_confirm,
	.cancel = auth_cancel,
};

static struct bt_conn_auth_info_cb conn_auth_info_callbacks = {
	.pairing_complete = pairing_complete,
	.pairing_failed = pairing_failed
};
#else
static struct bt_conn_auth_cb conn_auth_callbacks;
static struct bt_conn_auth_info_cb conn_auth_info_callbacks;
#endif

static void bt_receive_cb(struct bt_conn *conn, const uint8_t *const data,
			  uint16_t len)
{
	char addr[BT_ADDR_LE_STR_LEN] = {0};

	bt_addr_le_to_str(bt_conn_get_dst(conn), addr, ARRAY_SIZE(addr));

	LOG_INF("Received data from: %s", addr);

	// Analyze the protobuf message and send to LVGL display
	protobuf_analyze_message(data, len);

	// Generate and send echo response
	uint8_t echo_buffer[128];
	int echo_len = protobuf_generate_echo_response(data, len, echo_buffer, sizeof(echo_buffer));
	
	if (echo_len > 0) {
		LOG_INF("🔄 Attempting to send echo response (%d bytes)...", echo_len);
		int err = mentra_ble_send(conn, echo_buffer, echo_len);
		if (err) {
			LOG_ERR("❌ Failed to send echo response: %d (likely notification subscription issue)", err);
		} else {
			LOG_INF("✅ Sent echo response successfully: %s", echo_buffer);
		}
	} else {
		LOG_WRN("⚠️ No echo response generated (echo_len = %d)", echo_len);
	}

	// Also forward to UART for debugging
	for (uint16_t pos = 0; pos != len;) {
		struct uart_data_t *tx = k_malloc(sizeof(*tx));

		if (!tx) {
			LOG_WRN("Not able to allocate UART send data buffer");
			return;
		}

		/* Keep the last byte of TX buffer for potential LF char. */
		size_t tx_data_size = sizeof(tx->data) - 1;

		if ((len - pos) > tx_data_size) {
			tx->len = tx_data_size;
		} else {
			tx->len = (len - pos);
		}

		memcpy(tx->data, &data[pos], tx->len);

		pos += tx->len;

		/* Append the LF character when the CR character triggered
		 * transmission from the peer.
		 */
		if ((pos == len) && (data[len - 1] == '\r')) {
			tx->data[tx->len] = '\n';
			tx->len++;
		}

		int err = uart_tx(uart, tx->data, tx->len, SYS_FOREVER_MS);
		if (err) {
			k_fifo_put(&fifo_uart_tx_data, tx);
		}
	}
}

static struct mentra_ble_cb mentra_cb = {
	.received = bt_receive_cb,
};

void error(void)
{
	dk_set_leds_state(DK_ALL_LEDS_MSK, DK_NO_LEDS_MSK);

	while (true) {
		/* Spin for ever */
		k_sleep(K_MSEC(1000));
	}
}

#ifdef CONFIG_BT_NUS_SECURITY_ENABLED
static void num_comp_reply(bool accept)
{
	if (accept) {
		bt_conn_auth_passkey_confirm(auth_conn);
		LOG_INF("Numeric Match, conn %p", (void *)auth_conn);
	} else {
		bt_conn_auth_cancel(auth_conn);
		LOG_INF("Numeric Reject, conn %p", (void *)auth_conn);
	}

	bt_conn_unref(auth_conn);
	auth_conn = NULL;
}
#endif /* CONFIG_BT_NUS_SECURITY_ENABLED */

void button_changed(uint32_t button_state, uint32_t has_changed)
{
	uint32_t buttons = button_state & has_changed;

#ifdef CONFIG_BT_NUS_SECURITY_ENABLED
	if (auth_conn) {
		// Handle authentication buttons when in authentication mode
		if (buttons & KEY_PASSKEY_ACCEPT) {
			num_comp_reply(true);
		}

		if (buttons & KEY_PASSKEY_REJECT) {
			num_comp_reply(false);
		}
		return; // Don't handle battery buttons during authentication
	}
#endif /* CONFIG_BT_NUS_SECURITY_ENABLED */

	// Handle battery level control when not in authentication mode
	if (buttons & KEY_BATTERY_INCREASE) {
		LOG_INF("🔋⬆️  Button 1 pressed: Increasing battery level");
		protobuf_increase_battery_level();
	}

	if (buttons & KEY_BATTERY_DECREASE) {
		LOG_INF("🔋⬇️  Button 2 pressed: Decreasing battery level");
		protobuf_decrease_battery_level();
	}

	if (buttons & KEY_BATTERY_CHARGING_TOGGLE) {
		LOG_INF("🔋⚡ Button 3 pressed: Toggling charging status");
		protobuf_toggle_charging_state();
	}

	// **NEW: Direct HLS12VGA pattern shortcuts (combination presses)**
	// Check for pattern combinations when Button 3 is held with another button
	if ((button_state & KEY_HORIZONTAL_GRAYSCALE) == KEY_HORIZONTAL_GRAYSCALE && 
	    (has_changed & (DK_BTN1_MSK | DK_BTN3_MSK))) {
		LOG_INF("🎨 Button combo 3+1: Drawing HLS12VGA horizontal grayscale pattern");
		display_draw_horizontal_grayscale();
		return; // Don't process other button presses
	}
	
	if ((button_state & KEY_VERTICAL_GRAYSCALE) == KEY_VERTICAL_GRAYSCALE && 
	    (has_changed & (DK_BTN2_MSK | DK_BTN3_MSK))) {
		LOG_INF("🎨 Button combo 3+2: Drawing HLS12VGA vertical grayscale pattern");
		display_draw_vertical_grayscale();
		return; // Don't process other button presses
	}
	
	if ((button_state & KEY_CHESS_PATTERN) == KEY_CHESS_PATTERN && 
	    (has_changed & (DK_BTN4_MSK | DK_BTN3_MSK))) {
		LOG_INF("🎨 Button combo 3+4: Drawing HLS12VGA chess pattern");
		display_draw_chess_pattern();
		return; // Don't process other button presses
	}

	// **ORIGINAL: LVGL pattern cycling on dedicated Button 4 (when not combined)**
	if (buttons & KEY_LVGL_PATTERN_CYCLE && !(button_state & KEY_GRAYSCALE_MODIFIER)) {
		LOG_INF("🎨 Button 4 pressed: Cycling LVGL test pattern");
		display_cycle_pattern();
	}
}

static void configure_gpio(void)
{
	int err;

	// Always initialize buttons for battery level control
	err = dk_buttons_init(button_changed);
	if (err) {
		LOG_ERR("Cannot init buttons (err: %d)", err);
	}

	err = dk_leds_init();
	if (err) {
		LOG_ERR("Cannot init LEDs (err: %d)", err);
	}
}

int main(void)
{
	int blink_status = 0;
	int err = 0;

	LOG_INF("🚀🚀🚀 MAIN FUNCTION STARTED - v2.2.0-DISPLAY_OPEN_FIX 🚀🚀🚀");
	printk("🌟🌟🌟 MAIN FUNCTION PRINTK - v2.2.0-DISPLAY_OPEN_FIX 🌟🌟🌟\n");

	configure_gpio();

	// Log button functionality and initial battery level
	LOG_INF("🔋 Battery level control enabled:");
	LOG_INF("   📌 Button 1: Increase battery level (+5%%)");
	LOG_INF("   📌 Button 2: Decrease battery level (-5%%)");
	LOG_INF("   � Button 3: Toggle charging status");
	LOG_INF("   �📊 Current battery level: %u%%", protobuf_get_battery_level());

	// **NEW: Log display pattern controls**
	LOG_INF("🎨 Display pattern controls enabled:");
	LOG_INF("   📌 Button 4: Cycle LVGL test patterns");
	LOG_INF("   📌 Button 3+1: HLS12VGA horizontal grayscale (8-bit)");
	LOG_INF("   📌 Button 3+2: HLS12VGA vertical grayscale (8-bit)");
	LOG_INF("   📌 Button 3+4: HLS12VGA chess pattern");
	LOG_INF("   📊 Direct HLS12VGA access bypasses LVGL limitations");

	// Initialize brightness control
	LOG_INF("💡 LED 3 brightness control enabled:");
	LOG_INF("   📱 Mobile app can set brightness level (0-100%%)");
	LOG_INF("   📊 Current brightness level: %u%%", protobuf_get_brightness_level());
	
	// Set initial brightness to 50%
	protobuf_set_brightness_level(50);

	err = uart_init();
	if (err) {
		error();
	}

	if (IS_ENABLED(CONFIG_BT_NUS_SECURITY_ENABLED)) {
		err = bt_conn_auth_cb_register(&conn_auth_callbacks);
		if (err) {
			LOG_ERR("Failed to register authorization callbacks. (err: %d)", err);
			return 0;
		}

		err = bt_conn_auth_info_cb_register(&conn_auth_info_callbacks);
		if (err) {
			LOG_ERR("Failed to register authorization info callbacks. (err: %d)", err);
			return 0;
		}
	}

	err = bt_enable(NULL);
	if (err) {
		error();
	}

	LOG_INF("Bluetooth initialized");

	k_sem_give(&ble_init_ok);

	if (IS_ENABLED(CONFIG_SETTINGS)) {
		settings_load();
	}

	err = mentra_ble_init(&mentra_cb);
	if (err) {
		LOG_ERR("Failed to initialize Mentra BLE service (err: %d)", err);
		return 0;
	}

        // Initialize LVGL display system with working driver implementation
        printk("🔥🔥🔥 About to initialize LVGL display system... 🔥🔥🔥\n");
        
        // Start the LVGL display thread first!
        printk("🧵🧵🧵 Starting LVGL display thread... 🧵🧵🧵\n");
        lvgl_display_thread();
        printk("✅✅✅ LVGL display thread started! ✅✅✅\n");
        
        // Give the thread a moment to initialize
        k_msleep(100);
        
        // Send LCD_CMD_OPEN to start the LVGL display system
        printk("📡📡📡 Calling display_open() NOW... 📡📡📡\n");
        display_open();
        printk("✅✅✅ display_open() call completed! ✅✅✅\n");
        
        // Add direct HLS12VGA test from main thread
        LOG_INF("🖥️ Testing HLS12VGA display from main thread...");
        const struct device *test_disp = DEVICE_DT_GET(DT_CHOSEN(zephyr_display));
        if (device_is_ready(test_disp)) {
            LOG_INF("✅ HLS12VGA device ready in main: %s", test_disp->name);
            
            // Try to turn off blanking
            int ret = display_blanking_off(test_disp);
            LOG_INF("📺 Display blanking off result: %d", ret);
            
            // Try a simple write operation
            uint8_t test_data[8] = {0xFF, 0xFF, 0xFF, 0xFF, 0x00, 0x00, 0x00, 0x00};
            struct display_buffer_descriptor desc = {
                .buf_size = 8,
                .width = 4,
                .height = 1,
                .pitch = 4,
            };
            
            ret = display_write(test_disp, 0, 0, &desc, test_data);
            LOG_INF("🎨 Display write result: %d", ret);
            
            if (ret == 0) {
                LOG_INF("🎉 SUCCESS: HLS12VGA write operation completed!");
            } else {
                LOG_ERR("❌ FAILED: HLS12VGA write operation failed: %d", ret);
            }
        } else {
            LOG_ERR("❌ HLS12VGA device not ready in main");
        }
        
        // The LVGL demo thread is already defined in lvgl_demo.c - no need to call it here
        LOG_INF("LVGL demo thread will start automatically");

	k_work_init(&adv_work, adv_work_handler);
	advertising_start();

	for (;;) {
		dk_set_led(RUN_STATUS_LED, (++blink_status) % 2);
		k_sleep(K_MSEC(RUN_LED_BLINK_INTERVAL));
	}
}

void ble_write_thread(void)
{
	/* Don't go any further until BLE is initialized */
	k_sem_take(&ble_init_ok, K_FOREVER);
	struct uart_data_t mentra_data = {
		.len = 0,
	};

	for (;;) {
		/* Wait indefinitely for data to be sent over bluetooth */
		struct uart_data_t *buf = k_fifo_get(&fifo_uart_rx_data,
						     K_FOREVER);

		int plen = MIN(sizeof(mentra_data.data) - mentra_data.len, buf->len);
		int loc = 0;

		while (plen > 0) {
			memcpy(&mentra_data.data[mentra_data.len], &buf->data[loc], plen);
			mentra_data.len += plen;
			loc += plen;

			if (mentra_data.len >= sizeof(mentra_data.data) ||
			   (mentra_data.data[mentra_data.len - 1] == '\n') ||
			   (mentra_data.data[mentra_data.len - 1] == '\r')) {
				if (mentra_ble_send(current_conn, mentra_data.data, mentra_data.len)) {
					LOG_WRN("Failed to send data over BLE connection");
				}
				mentra_data.len = 0;
			}

			plen = MIN(sizeof(mentra_data.data), buf->len - loc);
		}

		k_free(buf);
	}
}

K_THREAD_DEFINE(ble_write_thread_id, STACKSIZE, ble_write_thread, NULL, NULL,
		NULL, PRIORITY, 0, 0);
